<template>
  <el-dialog :model-value="show" center width="60%" @close="onClose">
    <el-scrollbar height="43rem">
      <div>
        <h2>使用条款</h2>

        <p>感谢您使用「闲来 Admax」系统（以下简称“本系统”）。</p>
        <p>
          <b>
            重要条款：本系统不面向公众开放，仅用于模拟和演示。本系统无法提供必要的信息和数据保护等功能，所有隐私信息、重要数据泄漏的责任或其他任何责任均由本系统使用者承担。
            以下条款或内容与本条款冲突的以本重要条款提示为准，其他不与本条款冲突的条款继续有效。
          </b>
        </p>
        <p>
          本系统向公众开放，提供模拟演示、XXX、XXX等功能。在使用本系统前，敬请您仔细阅读以下各项使用条款（以下简称“本使用条款”）。
          您对本系统的使用（包括但不限于对本系统的访问、登录，对本系统内容的浏览和使用），将被视为您自愿承诺接受本声明的约束。
          如果您对本使用条款的内容不能接受，您应当立即停止使用本系统并迅速离开。
        </p>

        <h4>1. 本系统的使用</h4>
        <p>有限许可您在您的计算机设备上浏览（使用）本系统展示的内容（由本使用条款第2条规定）。</p>

        <h4>2. 知识产权声明</h4>
        <p>
          本系统，包括（但不仅限于）文字，内容，软件，录像，音乐，声音，图形，照片，图表，美术设计，图片，名称，标识，商标和/或服务标志（包括已注册和未注册的），以及其他资料（以下简称系统内容）都受到版权法，商标法和一切知识产权公约的保护。
          本系统开发方和运营方所有或控制下的内容和第三方所有或控制下，并授权本系统开发方和运营方使用的内容。
          所有代码，文章，讨论等一切构成本系统的元素都可能是受版权保护的作品。
          您同意遵守所有适用本系统的版权保护法律法规，以及所有本系统包含的补充性的版权说明或限制。
          本系统的内容均由相应的用户上传、维护。 对于本站内容的任何使用请遵守内容所附带的授权协议。
          如不清楚相应的授权协议请询问上传该内容的用户。
        </p>
        <p>
          任何在本系统上注册的帐号上传的内容的版权均归上传者所有，上传者承担所有被上传内容的版权责任。
          本系统有权展示上传者上传到本系统公共区域的内容。
        </p>

        <h4>3. 个人信息的保护</h4>
        <p>
          尊重访问本系统的任何个人的隐私信息。
          当您访问本系统的时候可能被要求提供您个人的基本资料（如姓名、电子邮件、电话号码等），您可以自行选择是否提供。
          对于您提供的个人信息，将根据中华人民共和国相关法律进行保密并严格保管，不会将这些信息以任何方式提供或展示给任何第三方，但下述情况除外：
        </p>
        <p>
          (一)
          当司法机关或行政机关依照法定程序和法定职权要求本系统披露个人资料时，我们将依法提供相关资料。对于此情况下的任何披露，本系统均得免责；
        </p>
        <p>
          (二)
          对于任何由黑客攻击、计算机病毒侵入或发作、或政府管制而造成的暂时性关闭等影响系统正常运营的不可抗力事件所造成的个人资料的泄露、丢失、被盗用或被篡改等，本系统均得免责；
        </p>
        <p>
          (三)
          对于用户将个人密码告知他人或与他人共享注册帐号所导致的任何个人资料泄露，丢失、被盗用或被篡改等，本系统不负任何责任；
        </p>
        <p>(四) 对于与本系统链接的任何其它系统的个人资料泄露，丢失、被盗用或被篡改等事件，本系统不负任何责任。</p>

        <h4>4. 系统的更新与变更</h4>
        <p>
          本系统上的内容仅为方便您获取信息，本系统开发方和运营方有权单方面在任何时间，对本系统的内容进行变更或更新，此种变更或更新无需以通知您或任何第三方为前提。
          您承认并接受上述变更或更新。 我们建议您定期访问本系统以尽快获知有关的更新或变更的信息。
        </p>

        <h4>5. 无担保声明</h4>
        <p>
          在法律允许的最大限度内，本系统及本系统的内容不包括任何明确或暗示的有关（但不限于）所有权，适销性，质量满意程度，特定用途的适用性，准确性、时效性和完整性，不侵犯知识产权和其它方权利的承诺。
        </p>
        <p>
          本系统开发方和运营方尽其合理的商业努力维护本系统的安全和功能，但不保证本系统上的所有功能正常运作，也不保证本系统连续性地或无故障运行或缺陷被及时更正。
        </p>
        <p>
          本系统开发方和运营方不保证本系统系统适合您的电脑操作系统性能，也不保证本系统或其服务器永不产生故障或没有病毒、木马程序和其他有害程序，亦不承担您因上述问题而产生的任何电脑的损坏的责任。
        </p>
        <p>本系统开发方和运营方不为您所使用的访问本系统的网络线路和设备的可靠性以及连续性承担责任。</p>

        <h4>6. 禁止盗链</h4>
        <p>
          禁止擅自利用本系统内容的网页构架系统的行为。本系统开发方和运营方保留断开任何未经授权指向本系统的超文本链接或网页构架系统的权利。
        </p>

        <h4>7. 终止使用</h4>
        <p>
          如果您的帐号违反当地相关法律法规或系统使用条款，在未经事先通知的情况下，本系统开发方和运营方有权自行判断并立即终止您对本系统的使用，或者采取措施禁止您对本系统的再次访问。
        </p>

        <h4>8. 准据法和管辖权</h4>
        <p>
          本系统内容及本使用条款的解释和适用均适用中华人民共和国法律，由于使用本系统而产生的一切纠纷，除另有约定，均由中华人民共和国（本系统开发方和运营方所在地）人民法院管辖。
        </p>

        <h4>9. 继续有效原则</h4>
        <p>如果本使用条款中的部分条款被有关机关认定为无效，则此无效部分并不影响本使用条款其他部分的效力，其他部分仍然有效。</p>
      </div>
    </el-scrollbar>
    <template #footer>
      <el-button type="primary" @click="onClose">确定</el-button>
    </template>
  </el-dialog>
</template>

<script setup>
defineProps({
  show: {
    type: Boolean,
    default: false,
    required: true
  }
})
const emits = defineEmits(['close'])

/**
 * 关闭时调用父组件的事件
 */
function onClose() {
  emits('close')
}
</script>
